<template>
  <div id="app">
    <div class="bpm">
      <p>hello</p>
      <p>{{ BPM.BPM_forWhat }}</p>
      <div>
        <h1> Выполняет задачи</h1>
        <p v-for="problem in BPM.BPM_problem" :key="problem.problem" class="info">
          {{ problem.problem }}
        </p>
      </div>
    </div>
  </div>
</template>

<script>
module.exports = {
  data() {
    return {
      BPM: {
        BPM_Info: 'BPM это  управление и оптимизация  бизнес процесса. Бизнес процесс подразумевает собой  постановку работы  предприятия так , чтобы  оно отвечало заказчикам и покупателям.',
        BPM_forWhat: 'BPM  нужен для автоматизации бизнес-процессов, основная цель это  автоматизировать концептуальную схему процесса, сделав из нее исполняемую схему. Есть Creatio оно служить для' +
          'управления взаимоотношениями с клиентами и системы управления бизнес-процессами.',
        BPM_problem: [
          {problem: "Создание бизнес-процессов"},
          {problem: 'Автоматизация бизнес-процессов'},
          {problem: 'Выполнение бизнес-процессов'},
          {problem: 'Мониторинг и оптимизация процессов'},
          {problem: 'Готовые инструменты для решения бизнес-задач'},
          {problem: 'Интеграции с другими системами'},
          {problem: 'Управление данными и документами'},
          {problem: 'Управление организационной структурой предприятия'},
        ]
      }
    }
  }
}
</script>
